learningTest/src/Catalogs/Вопросы/Вопросы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Вопросы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Вопрос</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВариантыОтветов</name>
    <attributes>
      <name>Ответ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Правильный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

learningTest/src/CommonModules/ОбщегоНазначения/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

//Отрисовать элементы формы
Процедура ОтрисоватьЭлементыФормы(ЭтаФорма) Экспорт
	
	СписокВопросов = Справочники.Вопросы.ПолучитьСписокВопросов();
	
	ЭлементГруппаСтраниц = ЭтаФорма.Элементы.Добавить("Страницы", Тип("ГруппаФормы"), ЭтаФорма);
	ЭлементГруппаСтраниц.Вид = ВидГруппыФормы.Страницы;
	
	Для Сч = 0 По СписокВопросов.Количество()-1 Цикл
		Номер = Строка(Сч + 1);	
		
		// Добавить вкладку с вопросом 
		ЭлементСтраница = ЭтаФорма.Элементы.Добавить("Страница" + Номер, Тип("ГруппаФормы"), ЭлементГруппаСтраниц);
		ЭлементСтраница.Вид = ВидГруппыФормы.Страница;
		ЭлементСтраница.ШрифтЗаголовка = НастройкиШрифта();
		ЭлементСтраница.Заголовок = "-" + Номер + "-";
		
		// Добавить текст вопроса       
		ЭлементВопрос = ЭтаФорма.Элементы.Добавить("Вопрос" + Номер, Тип("ДекорацияФормы"), ЭлементСтраница);
		ЭлементВопрос.Вид = ВидДекорацииФормы.Надпись;
		ЭлементВопрос.Шрифт = НастройкиШрифта(); 
		ЭлементВопрос.АвтоМаксимальнаяШирина = Ложь;
		ЭлементВопрос.Заголовок = СписокВопросов[Сч].Вопрос;
	
		// Добавить варианты ответов
		СоздатьВариантыОтветов(СписокВопросов[Сч].ВариантыОтветов, ЭлементСтраница, Номер, ЭтаФорма);	  
			
		// Добавить команду 
		НоваяКоманда = ЭтаФорма.Команды.Добавить("ПринятьОтвет" + Номер);
		НоваяКоманда.Действие = "ПринятьОтвет";
		НоваяКоманда.Заголовок = "Принять ответ";
		
		// Добавить кнопку
		НоваяКнопка = ЭтаФорма.Элементы.Добавить("КнопкаПринятьОтвет" + Номер, Тип("КнопкаФормы"), ЭлементСтраница);
		НоваяКнопка.ИмяКоманды = "ПринятьОтвет" + Номер;
		НоваяКнопка.Шрифт = НастройкиШрифта(); 
		
		// Добавить уведомление 
		ЭлементУведомление = ЭтаФорма.Элементы.Добавить("Уведомление" + Номер, Тип("ДекорацияФормы"), ЭлементСтраница);
		ЭлементУведомление.Вид = ВидДекорацииФормы.Надпись;
		ЭлементУведомление.Шрифт = НастройкиШрифта(); 
		ЭлементУведомление.АвтоМаксимальнаяШирина = Ложь;
		ЭлементУведомление.Заголовок = ""; 
		
		// Добавить текст вопроса       
		ЭлементПравильныйОтвет = ЭтаФорма.Элементы.Добавить("ПравильныйОтвет" + Номер, Тип("ДекорацияФормы"), ЭлементСтраница);
		ЭлементПравильныйОтвет.Вид = ВидДекорацииФормы.Надпись;
		ЭлементПравильныйОтвет.Шрифт = НастройкиШрифта(); 
		ЭлементПравильныйОтвет.Заголовок = СписокВопросов[Сч].ПравильныйОтвет;
		ЭлементПравильныйОтвет.Видимость = Ложь;
		
	КонецЦикла;  	

		
КонецПроцедуры

// Отрисовать варианты ответов
Процедура СоздатьВариантыОтветов(ВариантыОтветов, Страница, Номер, Форма)	
	
	//Создать реквизит варианты выбора
	НовыйРеквизит = Новый РеквизитФормы("Варианты" + Номер, Новый ОписаниеТипов("Число"),,"Варианты ответов");  

	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	// Создать группу вариантов
	ЭлементГруппаВариантов = Форма.Элементы.Добавить("ГруппаВариантов" + Номер, Тип("ГруппаФормы"), Страница);
	ЭлементГруппаВариантов.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ЭлементГруппаВариантов.Отображение = ОтображениеОбычнойГруппы.Нет;
	ЭлементГруппаВариантов.ОтображатьЗаголовок = ЛОЖЬ; 
	ЭлементГруппаВариантов.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	// Создать элемент варианта ответа
	ЭлементОтвет = Форма.Элементы.Добавить("Варианты" + Номер, Тип("ПолеФормы"), ЭлементГруппаВариантов);
	ЭлементОтвет.ПутьКДанным = "Варианты" + Номер;
	ЭлементОтвет.ШрифтЗаголовка = НастройкиШрифта();
	ЭлементОтвет.Вид = ВидПоляФормы.ПолеПереключателя;
	ЭлементОтвет.КоличествоКолонок = 1;
	ЭлементОтвет.Шрифт = НастройкиШрифта();

	//Элементы.ВариантыОтвета.СписокВыбора.Очистить();
	Для каждого Вариант Из ВариантыОтветов Цикл
		
		ЭлементОтвет.СписокВыбора.Добавить(Вариант.НомерСтроки, Вариант.Ответ);
	
	КонецЦикла; 
	
КонецПроцедуры

Функция СписокВопросов()

	Запрос1 = Новый Запрос;
	Запрос1.Текст = 
		"ВЫБРАТЬ
		|	Вопросы.Код КАК Код
		|ИЗ
		|	Справочник.Вопросы КАК Вопросы
		|ГДЕ
		|	Вопросы.ЭтоГруппа = ИСТИНА
		|	И Вопросы.Родитель.Код = &Код";
	
	Запрос1.УстановитьПараметр("Код", ПараметрыСеанса.КодТестирования);
	
	РезультатЗапроса = Запрос1.Выполнить();	
	МассивРазделов = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку(0);	
	
	Запрос2 = Новый Запрос;
	Запрос2.Текст = 
		"ВЫБРАТЬ
		|	Вопросы.Код КАК Код,
		|	Вопросы.Вопрос КАК Вопрос,
		|	Вопросы.ВариантыОтветов.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		Ответ КАК Ответ,
		|		Правильный КАК Правильный
		|	) КАК ВариантыОтветов,
		|	ВЗ.НомерСтроки КАК ПравильныйОтвет
		|ИЗ
		|	Справочник.Вопросы КАК Вопросы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВопросыВариантыОтветов.Ссылка КАК Ссылка,
		|			ВопросыВариантыОтветов.НомерСтроки КАК НомерСтроки
		|		ИЗ
		|			Справочник.Вопросы.ВариантыОтветов КАК ВопросыВариантыОтветов
		|		ГДЕ
		|			ВопросыВариантыОтветов.Правильный = ИСТИНА) КАК ВЗ
		|		ПО Вопросы.Ссылка = ВЗ.Ссылка
		|ГДЕ
		|	Вопросы.ЭтоГруппа = ЛОЖЬ
		|	И Вопросы.Родитель.Код В(&МассивРазделов)"; 
	
	Запрос2.УстановитьПараметр("МассивРазделов", МассивРазделов);
	
	РезультатЗапроса = Запрос2.Выполнить();	
	Выборка = РезультатЗапроса.Выгрузить();
	ПоследнийИндекс = Выборка.Количество() - 1;    
	
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	ТЗ = НовыйСписокВопросов(Выборка); 	

	Пока ТЗ.Количество() <> 14 Цикл
		
		ИндексСтр = ГСЧ.СлучайноеЧисло(0, ПоследнийИндекс);
		ВыбранныйВопрос = Выборка[ИндексСтр]; 		
		НайденнаяСтрока = ТЗ.Найти(ВыбранныйВопрос.Код, "Код");
		
		Если НайденнаяСтрока = Неопределено Тогда
			
			СтрокаТЗ = ТЗ.Добавить();
			СтрокаТЗ.Код = ВыбранныйВопрос.Код;
			СтрокаТЗ.Вопрос = ВыбранныйВопрос.Вопрос; 
			СтрокаТЗ.ВариантыОтветов = ВыбранныйВопрос.ВариантыОтветов;
            СтрокаТЗ.ПравильныйОтвет = ВыбранныйВопрос.ПравильныйОтвет; 
			
		КонецЕсли;  
			
	КонецЦикла; 	
	
	Возврат ТЗ; 
	
КонецФункции 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция НовыйСписокВопросов(Знач Выборка)
	
	ТЗ = Новый ТаблицаЗначений;
	Для каждого Колонка из Выборка.Колонки Цикл 
		
		ТЗ.Колонки.Добавить(Колонка);		
		
	КонецЦикла;
	
	Возврат ТЗ;
	
КонецФункции 

Функция НастройкиШрифта() 
	
	Возврат Новый Шрифт("Calibri", 13);
	
КонецФункции

#КонецОбласти
